Revit 2027 API
HorizontalCurveEndpoint.Station Property
 The endpoint's station value.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Station { get; }
Public ReadOnly Property Station As Double
	Get
public:
property double Station {
	double get ();
}
member Station : float with get
Property Value
Double
See Also
Reference
HorizontalCurveEndpoint Class
Autodesk.Revit.DB.Infrastructure Namespace